Repository: DieInhaltsangabe/AppProgrammingFlatter
Catalog: cuberino/lib/l10n/app_*.arb
Languages: de, tr

source: Settings
de: Einstellungen
tr: Ayarlar

source: Language
de: Sprache
tr: Dil

# timerOff
source: Press and hold to start the timer.
de: Drücke und halte um die Stoppuhr zu starten.
tr: Zaman saati başlatmak için basılı tutunuz.

# timerArmed
source: Let go to start the timer. Press again to stop the timer.
de: Lassen Sie los um die Stoppuhr zu starten. Drücken Sie erneut um die Stoppuhr daraufhin zu stoppen.
tr: Zamanlayıcıyı başlatmak için, tutmayı bırak. Zamanlayıcıyı durdurmak için tekrar basın

# deleteButton
source: Delete
de: Löschen
tr: sil

source: Generate scramble
de: Generiere Permutation
tr: Karıştırmayi oluştur

# best
source: PR:
de: Bestzeit:
tr: En iyi:

# avg
source: Average:
de: Durchschnitt:
tr: Ortalama:

source: Background color
de: Hintergrundfarbe
tr: Arka plan rengi

# emptyLogs
source: No logs have been found.
de: Es wurden keine Logs gefunden.
tr: Bulunamadi.

# showLogs
source: Show Log
de: Zeige Logs
tr: Log göster

source: Todays Challenge
de: Heutige Challenge
tr: Bügünün Challangesi

# changecolor
source: Change background color
de: Hintergrundfarbe ändern
tr: Arka plan rengi değiştir

# challengeSolutionToPattern
source: To get from a solved Cube to the pattern use this algorithm
de: Um den gelösten Cube zu dem Pattern zu bekommen
tr: Çözülmüş bir Küpten desene ulaşmak için bu algoritmayı kullanın

# challengePatternToSolved
source: To solve the cube back to normal, use this algorithm
de: Um vom Pattern den Cube zu lösen
tr: Küpü normale döndürmek için bu algoritmayı kullanın

# challangeInstruction
source: Try to scramble your cube to get this pattern
de: Versuche dieses Pattern zu bekommen
tr: Bu modeli elde etmeye çalışın

source: Input
de: Würfel eingeben
tr: Küp girişi

# solve
source: Solve Cube
de: Löse Würfel
tr: Küpü çöz

source: Solution
de: Lösung
tr: Çözüm

# switchToCubeNet
source: Switch to cube net view
de: Zu Würfelnetzansicht wechseln
tr: Küp ağı görüntüle

source: Show Solutions
de: Zeige Lösungen
tr: Çözümleri göster

# switchToFaceView
source: Switch to cube face view
de: Zu Seitenansicht wechseln
tr: Küp yüz görünümüne geç

# starterLevel
source: Beginner
de: Anfänger
tr: Başlangıç

# starterLevelText
source: Solving for the first time
de: Erstes mal lösen
tr: İlk kez çözme

# advancedLevel
source: Advanced
de: Fortgeschritten
tr: İleri Seviye

# advancedLevelText
source: Tricks for solving faster
de: Tricks zum schneller lösen
tr: Daha hızlı çözme hileleri

# expertLevel
source: Expert
de: Experte
tr: Uzman

# expertLevelText
source: Solving with one hand
de: Einhändig Lösen
tr: Tek el ile çözme

# geniusLevel
source: Genius
tr: Dahi

# geniusLevelText
source: Let yourself be surprised
de: Lass dich überraschen
tr: Kendini şaşırt

source: White Cross
de: Weißes Kreuz
tr: Beyaz Haç

source: First Step
de: Erster Schritt
tr: İlk Adım

# firstStepText
source: We start by solving the white edges. Of course, you can start with any other color, but in this tutorial we take the white side as an example. We already know that the center stones always stay in the same place. Therefore, we have to make sure that the second color of the edges also matches the center stones of the middle side. This step is intuitive and relatively easy, as there are not yet so many solved stones to pay attention to. In many cases, you just have to turn the edges into their solved state.
de: Wir starten mit dem Lösen der weißen Kanten. Du kannst natürlich auch mit jeder anderen Farbe beginnen, doch in diesem Tutorial nehmen wir die weiße Seite als Beispiel. Wir wissen ja bereits, dass die mittleren Steine immer am gleichen Platz bleiben. Deshalb müssen wir darauf aufpassen, dass auch die zweite Farbe der Kanten mit den mittleren Steine der mittleren Seite übereinstimmt. Dieser Schritt ist intuitiv und relativ einfach, da es noch nicht so viele gelöste Steine gibt, auf die man achten muss. In vielen Fällen muss man die Kanten nur in ihren gelösten Zustand drehen.
tr: Beyaz kenarları çözmekle başlıyoruz. Tabii ki başka bir renkle de başlayabilirsiniz, ancak bu eğitimde beyaz tarafı örnek alıyoruz. Merkez taşların her zaman aynı yerde kaldığını zaten biliyoruz. Bu yüzden, kenarların ikinci renginin de orta tarafın merkez taşlarıyla eşleşmesine dikkat etmeliyiz. Bu adım, dikkat etmeniz gereken çok fazla çözülmüş taş olmadığı için sezgisel ve nispeten kolaydır. Çoğu durumda, kenarları çözülmüş durumuna çevirmeniz yeterlidir.

# whiteSide
source: Solving the White Side
de: Weiße Seite
tr: Beyaz Köşeleri Çözme

# secondStep
source: Solving the White Corners
de: Lösen der weißen Ecken
tr: Beyaz Yüzü Çözme

# secondStepText
source: After solving the white edges, we complete the white face with the corners. This step is once again intuitive to solve, and you should not memorize any specific algorithms. However, if you encounter difficulties solving the white corners, here is a simple algorithm that you repeat until the corner is solved: Bring the corner to the position it should be (Front-Right-Top) and repeat the above algorithm until the corner is solved. This algorithm repeatedly swaps the piece between the two dark marked places, changing its orientation in the process.
de: Nachdem wir die weißen Kanten gelöst haben, vervollständigen wir die weiße Fläche mit den Ecken. Dieser Schritt ist erneut intuitiv zu lösen und du solltest dir keine speziellen Algorithmen merken. Solltest du allerdings Schwierigkeiten haben, die weißen Ecken zu lösen, dann ist hier ein einfacher Algorithmus, den du solange ausführst, bis die Ecke gelöst ist: Bringe die Ecke unter die Position an die sie gelangen soll (Vorne-Rechts-Oben) und wiederhole den obenstehenden Algorithmus bis die Ecke gelöst ist. Dieser Algorithmus tauscht den Stein immer wieder zwischen den beiden dunkel markierten Plätze und verändert dabei seine Orientierung.
tr: Beyaz kenarları çözdükten sonra, beyaz yüzü köşelerle tamamlıyoruz. Bu adımı tekrar çözmek sezgisel ve özel algoritmaları hatırlamanıza gerek yok. Ancak, beyaz köşeleri çözmekte zorlanıyorsanız, işte köşeyi çözene kadar tekrarlayabileceğiniz basit bir algoritma: Köşeyi gitmesi gereken konuma getir (Ön-Sağ-Yukarı) ve yukarıdaki algoritmayı köşe çözülene kadar tekrarla. Bu algoritma, taşı sürekli olarak iki koyu işaretli yer arasında değiştirir ve bu sırada yönelimini değiştirir.

source: Middle Layer
de: Mittlere Ebene
tr: Orta Katman

# thirdStep
source: Solving the 2nd Layer
de: 2 Ebene Lösen
tr: 2. Katmanı Çözme

# thirdStepText
source: Now that we've solved the white side, we turn it downward as we no longer need it. Up to this point, solving the cube has been relatively easy and intuitive, but that changes now. Many people get stuck at this point because the algorithm to solve the second layer is often repeated four times before the second layer is solved. We now need to learn two algorithms that are symmetric to each other. The right algorithm brings the edge from Front-Top to Front-Right position, while the left one brings the Front-Top edge to Front-Left position. If there are no edges on the top side, you need to bring them out first. Use the same algorithm for this. Afterward, you can insert the edge as usual.
de: Jetzt haben wir die weiße Seite gelöst und drehen diese nun nach unten, da wir sie nicht mehr benötigen. Bis jetzt war die Lösung des Würfels relativ einfach und intuitiv, doch das ändert sich jetzt. Viele Leute bleiben an diesem Punkt hängen, denn der Algorithmus mit dem man die zweite Ebene löst ist meist viermal auszuführen, bevor die zweite Ebene gelöst ist. Wir müssen jetzt zwei Algorithmen lernen, welche symmetrisch zueinander sind. Der rechte Algorithmus bring die Kante von der Vorderen-Oberen zur Vorderen-Rechten Position, während der Linke die Vordere-Obere Kante zur Vordere-Linke Position bringt. Wenn keine Kante mehr auf der oberen Seite ist, musst du diese zuerst herausholen. Hierfür benutzt du den gleichen Algorithmus. Danach kannst du die Kante ganz normal einfügen.
tr: Şimdi beyaz yüzü çözdük ve onu artık ihtiyaç duymadığımız için aşağı çeviriyoruz. Şu ana kadar küpü çözmek oldukça kolay ve sezgisel oldu, ancak bu şimdi değişiyor. Birçok kişi bu noktada takılır çünkü genellikle ikinci katmanı çözmek için kullanılan algoritma, ikinci katman çözülmeden önce genellikle dört kez tekrarlanmalıdır. Şimdi birbirine simetrik iki algoritma öğrenmemiz gerekiyor. Sağ algoritma, Ön-Yukarı'dan Ön-Sağ konumuna kenarı getirirken, sol algoritma Ön-Yukarı kenarını Ön-Sol konumuna getirir. Üst tarafta kenar yoksa, önce onları çıkarmalısın. Bunun için aynı algoritmayı kullan. Sonra kenarı normal şekilde yerleştirebilirsin.

source: Top Cross
de: Oberes Kreuz
tr: Üst Haç

# fourthStep
source: Yellow Side
de: Gelbe Seite
tr: Sarı Yüz

# fourthStepText
source: In the fourth step, we form a yellow cross on the yellow side. It is possible that the second color of an edge does not match that of the middle side, but that's okay because we will solve this in the next step. In this step, all yellow edges are oriented after all other edges are solved. These cases may arise. Use the following algorithms to solve the cases. Dot - If we have this case where no edge is oriented, we must execute the algorithm three times. Make sure to hold the cube correctly after this step, as the next case requires a different position. L-Case - Now we just need to execute the algorithm twice. Make sure that the oriented edges are at the back and left. (There is also an algorithm to go directly to the solved cross: F U R U' R' F'). Line - Execute the algorithm once more to complete the cross. Cross - The cross is finished, and you can proceed to the next step.
de: Im vierten Schritt bilden wir ein gelbes Kreuz auf der gelben Seite. Hierbei kann es durchaus vorkommen, dass die zweite Farbe einer Kante nicht mit der der mittleren Seite übereinstimmt, das ist aber nicht schlimm, da wir dies im nächsten Schritt lösen. In diesem Schritt werden alle gelben Kanten orientiert, nachdem alle anderen Kanten gelöst wurden. Diese Fälle können dabei auftreten. Nutze die folgenden Algorithmen um die Fälle zu lösen. Punkt – Wenn wir diesen Fall haben, bei dem keine Kante orientiert ist, müssen wir den Algorithmus dreimal ausführen. Achte darauf, dass du nach diesem Schritt den Würfel wieder richtig hältst, da der nächste Fall eine andere Position erfordert. L-Fall – Jetzt müssen wir den Algorithmus nur noch zweimal ausführen. Versichere dich, dass die orientierten Kannten hinten und links sind. (Es gibt auch einen Algorithmus um direkt zum gelösten Kreuz zu gelangen: F U R U' R' F'). Linie – Führe den Algorithmus noch einmal aus um das Kreuz zu vervollständigen Kreuz – Das Kreuz ist fertig und du kannst mit dem nächsten Schritt fortfahren.
tr: Dördüncü adımda, sarı yüzde bir sarı haç oluşturuyoruz. Bir kenarın ikinci rengi orta kısmın rengiyle uyuşmuyorsa, bu sorun değil çünkü bunu bir sonraki adımda çözeceğiz. Bu adımda, diğer kenarlar çözüldükten sonra tüm sarı kenarlar yönlendirilir. Bu durumlar ortaya çıkabilir. Durumları çözmek için aşağıdaki algoritmaları kullan. Nokta - Yönlendirilmemiş bir kenarın olduğu durumda algoritmayı üç kez çalıştırmalıyız. Bu adımdan sonra küpü doğru tuttuğunuza emin olun, çünkü bir sonraki durum farklı bir pozisyon gerektirir. L-Durumu - Şimdi sadece algoritmayı iki kez çalıştırmamız gerekiyor. Yönlendirilmiş kenarların arkada ve solda olduğundan emin olun. (Doğrudan çözülen haça gitmek için bir algoritma da var: F U R U' R' F'). Çizgi - Haç'ı tamamlamak için algoritmayı bir kez daha çalıştırın. Haç - Haç tamamlandı ve bir sonraki adıma geçebilirsiniz.

# changeEdges
source: Swapping Edges
de: Tauschen der Kanten
tr: Kenarları Değiştirme

# fifthStep
source: Correct Position of Edges
de: Richtige Postion der Kanten
tr: Kenarların Doğru Konumu

# fifthStepText
source: We now have the yellow cross on the upper face, but the side colors of the edges still do not match those of the sides. We must now bring them to the correct position. To bring them to the right place, we use an algorithm that swaps the Front-Top and Left-Top edge: R U R' U R U2 R' U. In some cases, two opposite edges need to be swapped. For this, the algorithm must be executed twice. You need to run the algorithm once, then bring the edges back to the correct position before executing it again.
de: Wir haben nun das gelbe Kreuz auf der oberen Fläche, doch die seitlichen Farben der Kannten stimmen noch nicht mit denen der Seiten überein. Wir müssen diese nun an die richtige Position bringen. Um sie an die richtige Stelle zu bringen benutzen wir einen Algorithmus, der die Vordere-Obere und die Linke-Obere Kante miteinander tauscht R U R' U R U2 R' U. n manchen Fällen müssen zwei gegenüber liegende Kanten getauscht werden. Hierfür muss der Algorithmus zweimal ausgeführt werden. Du musst den Algorithmus einmal ausführen, die Kanten dann wieder an die richtige Position bringen, um ihn erneut auszuführen.
tr: Üst yüzde şimdi sarı bir haçımız var, ancak kenarların yan renkleri hala yan yüzlerin renkleriyle eşleşmiyor. Şimdi bunları doğru konuma getirmemiz gerekiyor. Onları doğru yere getirmek için, Front-Yukarı ve Sol-Yukarı kenarlarını birbirleriyle değiştiren bir algoritma kullanırız: R U R' U R U2 R' U. Bazı durumlarda, iki karşıt kenarı değiştirmemiz gerekebilir. Bunun için algoritmayı iki kez çalıştırmalısınız. Algoritmayı bir kez çalıştırın, sonra kenarları doğru konuma getirip tekrar çalıştırın.

# changeCorners
source: Swapping Corners
de: Tauschen der Ecken
tr: Köşeleri Değiştirme

# sixthStep
source: All in Position
de: Alles in Position
tr: Her Şey Doğru Konumda

# sixthStepText
source: We're almost there. Only the yellow corners are left to solve the cube. We also solve the corners in two steps. First, we will bring the corners to the right position, and then we will orient them in the next step. U R U' L' U R' U' L This algorithm swaps three corners counterclockwise. The Front-Right-Top corner remains in place. When you reach this point in the solution, look for a corner in the correct position. If you find one, hold it Front-Right. Now, execute the algorithm, and if the corners are not in the right position yet, execute it again. If none of the corners is in the correct position, you need to execute the algorithm once. After that, at least one corner is definitely in the right position.
de: Wir haben es fast geschafft. Nur noch die gelben Ecken sind übrig, um den Würfel zu lösen. Auch die Ecken lösen wir in zwei Schritten. Zuerst werden wir die Ecken an die richtige Stelle bringen, um sie dann im nächsten Schritt zu orientieren. U R U' L' U R' U' L Dieser Algorithmus tauscht, drei Ecken gegen dem Uhrzeigersinn. Die Vordere-Rechte-Obere bleibt an ihrem Platz. Wenn du diesen Punkt der Lösung erreicht hast, suchst du nach einer Ecke in der richtigen Position. Wenn du eine findest, hältst du sie Vorne-Rechts. Nun führst du den Algorithmus aus und sollten die Ecken noch nicht an der richtigen Stelle sein führst du ihn erneut aus. Wenn keine der Ecken an der richtigen Position ist musst du den Algorithmus einmal ausführen. Danach ist auf jeden Fall eine Ecke an der richtigen Position.
tr: Neredeyse bitti. Küpü çözmek için sadece sarı köşeler kaldı. Köşeleri de iki adımda çözeceğiz. İlk olarak, köşeleri doğru konuma getireceğiz ve sonra onları bir sonraki adımda yönlendireceğiz. U R U' L' U R' U' L Bu algoritma üç köşeyi saat yönünde değiştirir. Front-Sağ-Yukarı köşesi yerinde kalır. Çözümde bu noktaya ulaştığınızda, doğru pozisyondaki bir köşeyi arayın. Bir tane bulursanız, onu Front-Sağ olarak tutun. Şimdi algoritmayı çalıştırın ve köşeler henüz doğru pozisyonda değilse, tekrar çalıştırın. Eğer köşelerin hiçbiri doğru pozisyonda değilse, algoritmayı bir kez çalıştırmalısınız. Bundan sonra en azından bir köşe kesinlikle doğru pozisyonda olacaktır.

# turnCorners
source: Corner Orientation
de: Orientierung der Ecken
tr: Köşe Yönlendirmesi

# seventhStep
source: Last Step
de: Letzter Schritt
tr: Son Adım

# seventhStepText
source: In the final step, every piece is in the position it should be, but the yellow corners are still oriented incorrectly. To solve the cube, we need to use the same algorithm we used to solve the corners of the first layer. At the beginning, hold a twisted corner in the Front-Right-Top position. Now, repeat the R' D' R D algorithm until the yellow color is facing up. Then, turn the top layer until another unsolved corner is in the marked area and repeat the R' D' R D algorithm again until the corner is solved. Repeat this process with all the remaining corners until all corners are solved.
de: Im letzten Schritt ist jeder Stein an der Position an der er sein soll, doch die gelben Ecken sind noch falsch orientiert. Um den Würfel zu lösen müssen wir wieder den gleichen Algorithmus benutzen, den wir bereits verwendet haben um die Ecken der ersten Ebene zu lösen. Zu Beginn hältst du eine verdrehte Ecke in die Vordere-Rechte-Obere Position. Wiederhole jetzt den R' D' R D Algorithmus bis die gelbe Farbe nach oben zeigt. Drehe nun die obere Ebene, bis eine weitere ungelöste Ecke in dem makierten Bereich ist und wiederhole erneut den R' D' R D Algorithmus, bis die Ecke gelöst ist. Führe dieses Verfahren mit allen weiteren Ecken durch, bis alle Ecken gelöst sind.
tr: Son adımda, her parça olması gereken yerde, ancak sarı köşeler hala yanlış yönlendirilmiş durumda. Küpü çözmek için, bir önceki adımda kullandığımız aynı algoritmayı kullanmamız gerekiyor. Başlangıçta, Front-Sağ-Yukarı pozisyonunda bir çapraz köşe tutun. Şimdi sarı rengin yukarı bakmasını sağlayana kadar R' D' R D algoritmasını tekrarlayın. Sonra üst katmanı çevirin, başka bir çözülmeyen köşe makineli alan içindeyse ve köşe çözülünceye kadar tekrar R' D' R D algoritmasını tekrarlayın. Bu işlemi diğer tüm köşelerle tekrarlayarak tüm köşeler çözülünceye kadar devam edin.
